tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            alphatWallFunction;
        value           uniform 0;
    }

    igloo_region0
    {
        type            alphatWallFunction;
        value           uniform 0;
    }

    twoFridgeFreezers_seal_0
    {
        type            alphatWallFunction;
        value           uniform 0;
    }

    twoFridgeFreezers_herring_1
    {
        type            alphatWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
